{
    "walk" : {
        "shortName": "walk",
        "longName": "Walking and power-walking",
        "menuText": "Have you been walking today?",
        "longText": "<p>Walking (also known as ambulation) is one of the main gaits of locomotion among legged animals, and is typically slower than running and other gaits. Walking is defined by an 'inverted pendulum' gait in which the body vaults over the stiff limb or limbs with each step. This applies regardless of the number of limbs - even arthropods, with six, eight or more limbs, walk.</p>",
        "unit": "minutes",
        "recordMessage": " minutes of walking today, well done!"
    },
    "run" : {
        "shortName": "run",
        "longName": "Running or jogging",
        "menuText": "Been out for a run?",
        "longText": "<p>Running is a means of terrestrial locomotion allowing humans and other animals to move rapidly on foot. It is simply defined in athletics terms as a gait in which at regular points during the running cycle both feet are off the ground. This is in contrast to walking, where one foot is always in contact with the ground, the legs are kept mostly straight and the center of gravity vaults over the stance leg or legs in an inverted pendulum fashion.</p> <p>A characteristic feature of a running body from the viewpoint of spring-mass mechanics is that changes in kinetic and potential energy within a stride occur simultaneously, with energy storage accomplished by springy tendons and passive muscle elasticity. The term running can refer to any of a variety of speeds ranging from jogging to sprinting.</p>",
        "unit": "kilometers",
        "recordMessage": " kms run today, great work!"
    },
    "dance" : {
        "shortName": "dance",
        "longName": "Dancing and aerobics",
        "menuText": "Is today a dancing day?",
        "longText": "<p>Dance is a type of art that generally involves movement of the body, often rhythmic and to music. It is performed in many cultures as a form of emotional expression, social interaction, or exercise, in a spiritual or performance setting, and is sometimes used to express ideas or tell a story. Dance may also be regarded as a form of nonverbal communication between humans or other animals, as in bee dances and behaviour patterns such as a mating dances.</p>",
        "unit": "songs",
        "recordMessage": " songs danced today!"
    },
    "cycle" : {
        "shortName": "cycle",
        "longName": "Cycling",
        "menuText": "Is today a dancing day?",
        "longText": "<p>Cycling, also called bicycling or biking, is the use of bicycles for transport, recreation, or for sport.[1] Persons engaged in cycling are referred to as 'cyclists', 'bikers', or less commonly, as 'bicyclists'. Apart from two-wheeled bicycles, 'cycling' also includes the riding of unicycles, tricycles, quadracycles, and similar human-powered vehicles (HPVs).</p>",
        "unit": "kilometers",
        "recordMessage": " kms of cycle power today!"
    },
    "meditate" : {
        "shortName": "meditate",
        "longName": "Meditation",
        "menuText": "Have you had your meditation moment today?",
        "longText": "<p>Meditation is a practice in which an individual trains the mind or induces a mode of consciousness, either to realize some benefit[1] or as an end in itself. The term meditation refers to a broad variety of practices (much like the term sports) that includes techniques designed to promote relaxation, build internal energy or life force (qi, ki, prana, etc.) and develop compassion, love, patience, generosity and forgiveness.</p> <p>A particularly ambitious form of meditation aims at effortlessly sustained single-pointed concentration meant to enable its practitioner to enjoy an indestructible sense of well-being while engaging in any life activity.</p>",
        "unit": "minutes",
        "recordMessage": " minutes of inner peace!"
    }
}